; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-4-19)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	city17 - city
	city18 - city
	city19 - city
	city20 - city
	city21 - city
	city22 - city
	city23 - city
	city24 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city9)
	(fuel-level plane1 fl6)
	(at plane2 city3)
	(fuel-level plane2 fl5)
	(at plane3 city13)
	(fuel-level plane3 fl4)
	(at plane4 city10)
	(fuel-level plane4 fl3)
	(at person1 city4)
	(at person2 city1)
	(at person3 city0)
	(at person4 city13)
	(at person5 city9)
	(at person6 city9)
	(at person7 city19)
	(at person8 city4)
	(at person9 city15)
	(at person10 city2)
	(at person11 city9)
	(at person12 city21)
	(at person13 city20)
	(at person14 city8)
	(at person15 city23)
	(at person16 city22)
	(at person17 city21)
	(at person18 city6)
	(at person19 city20)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane1 city0)
	(at person1 city5)
	(at person2 city6)
	(at person3 city9)
	(at person4 city8)
	(at person5 city23)
	(at person6 city15)
	(at person7 city7)
	(at person8 city22)
	(at person9 city9)
	(at person11 city24)
	(at person12 city1)
	(at person13 city1)
	(at person14 city14)
	(at person15 city24)
	(at person16 city8)
	(at person17 city3)
	(at person18 city7)
	(at person19 city22)
	))

)

; plan
1. (fly plane4 city10 city0 fl3 fl2)
   deleted: (at plane4 city10) (fuel-level plane4 fl3)
   added: (at plane4 city0) (fuel-level plane4 fl2)
   goals met: 0 of 19
2. (board person3 plane4 city0)
   deleted: (at person3 city0)
   added: (in person3 plane4)
   goals met: 0 of 19
3. (zoom plane4 city0 city9 fl2 fl1 fl0)
   deleted: (at plane4 city0) (fuel-level plane4 fl2)
   added: (at plane4 city9) (fuel-level plane4 fl0)
   goals met: 0 of 19
4. (debark person3 plane4 city9)
   deleted: (in person3 plane4)
   added: (at person3 city9)
   goals met: 1 of 19
5. (board person4 plane3 city13)
   deleted: (at person4 city13)
   added: (in person4 plane3)
   goals met: 1 of 19
6. (zoom plane3 city13 city8 fl4 fl3 fl2)
   deleted: (at plane3 city13) (fuel-level plane3 fl4)
   added: (at plane3 city8) (fuel-level plane3 fl2)
   goals met: 1 of 19
7. (debark person4 plane3 city8)
   deleted: (in person4 plane3)
   added: (at person4 city8)
   goals met: 2 of 19
8. (board person14 plane3 city8)
   deleted: (at person14 city8)
   added: (in person14 plane3)
   goals met: 2 of 19
9. (zoom plane3 city8 city14 fl2 fl1 fl0)
   deleted: (at plane3 city8) (fuel-level plane3 fl2)
   added: (at plane3 city14) (fuel-level plane3 fl0)
   goals met: 2 of 19
10. (debark person14 plane3 city14)
   deleted: (in person14 plane3)
   added: (at person14 city14)
   goals met: 3 of 19
11. (board person6 plane1 city9)
   deleted: (at person6 city9)
   added: (in person6 plane1)
   goals met: 3 of 19
12. (board person5 plane1 city9)
   deleted: (at person5 city9)
   added: (in person5 plane1)
   goals met: 3 of 19
13. (zoom plane1 city9 city15 fl6 fl5 fl4)
   deleted: (at plane1 city9) (fuel-level plane1 fl6)
   added: (at plane1 city15) (fuel-level plane1 fl4)
   goals met: 3 of 19
14. (board person11 plane4 city9)
   deleted: (at person11 city9)
   added: (in person11 plane4)
   goals met: 3 of 19
15. (refuel plane4 city9 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 3 of 19
16. (fly plane4 city9 city24 fl1 fl0)
   deleted: (at plane4 city9) (fuel-level plane4 fl1)
   added: (at plane4 city24) (fuel-level plane4 fl0)
   goals met: 3 of 19
17. (debark person11 plane4 city24)
   deleted: (in person11 plane4)
   added: (at person11 city24)
   goals met: 4 of 19
18. (board person9 plane1 city15)
   deleted: (at person9 city15)
   added: (in person9 plane1)
   goals met: 4 of 19
19. (zoom plane1 city15 city23 fl4 fl3 fl2)
   deleted: (at plane1 city15) (fuel-level plane1 fl4)
   added: (at plane1 city23) (fuel-level plane1 fl2)
   goals met: 4 of 19
20. (debark person5 plane1 city23)
   deleted: (in person5 plane1)
   added: (at person5 city23)
   goals met: 5 of 19
21. (board person15 plane1 city23)
   deleted: (at person15 city23)
   added: (in person15 plane1)
   goals met: 5 of 19
22. (zoom plane1 city23 city0 fl2 fl1 fl0)
   deleted: (at plane1 city23) (fuel-level plane1 fl2)
   added: (at plane1 city0) (fuel-level plane1 fl0)
   goals met: 6 of 19
23. (zoom plane2 city3 city1 fl5 fl4 fl3)
   deleted: (at plane2 city3) (fuel-level plane2 fl5)
   added: (at plane2 city1) (fuel-level plane2 fl3)
   goals met: 6 of 19
24. (zoom plane2 city1 city20 fl3 fl2 fl1)
   deleted: (at plane2 city1) (fuel-level plane2 fl3)
   added: (at plane2 city20) (fuel-level plane2 fl1)
   goals met: 6 of 19
25. (board person19 plane2 city20)
   deleted: (at person19 city20)
   added: (in person19 plane2)
   goals met: 6 of 19
26. (board person13 plane2 city20)
   deleted: (at person13 city20)
   added: (in person13 plane2)
   goals met: 6 of 19
27. (refuel plane1 city0 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 6 of 19
28. (fly plane2 city20 city1 fl1 fl0)
   deleted: (at plane2 city20) (fuel-level plane2 fl1)
   added: (at plane2 city1) (fuel-level plane2 fl0)
   goals met: 6 of 19
29. (refuel plane2 city1 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 6 of 19
30. (board person2 plane2 city1)
   deleted: (at person2 city1)
   added: (in person2 plane2)
   goals met: 6 of 19
31. (debark person13 plane2 city1)
   deleted: (in person13 plane2)
   added: (at person13 city1)
   goals met: 7 of 19
32. (fly plane2 city1 city22 fl1 fl0)
   deleted: (at plane2 city1) (fuel-level plane2 fl1)
   added: (at plane2 city22) (fuel-level plane2 fl0)
   goals met: 7 of 19
33. (refuel plane2 city22 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 7 of 19
34. (debark person19 plane2 city22)
   deleted: (in person19 plane2)
   added: (at person19 city22)
   goals met: 8 of 19
35. (board person16 plane2 city22)
   deleted: (at person16 city22)
   added: (in person16 plane2)
   goals met: 8 of 19
36. (fly plane2 city22 city6 fl1 fl0)
   deleted: (at plane2 city22) (fuel-level plane2 fl1)
   added: (at plane2 city6) (fuel-level plane2 fl0)
   goals met: 8 of 19
37. (refuel plane2 city6 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 8 of 19
38. (debark person2 plane2 city6)
   deleted: (in person2 plane2)
   added: (at person2 city6)
   goals met: 9 of 19
39. (board person18 plane2 city6)
   deleted: (at person18 city6)
   added: (in person18 plane2)
   goals met: 9 of 19
40. (fly plane2 city6 city7 fl1 fl0)
   deleted: (at plane2 city6) (fuel-level plane2 fl1)
   added: (at plane2 city7) (fuel-level plane2 fl0)
   goals met: 9 of 19
41. (refuel plane2 city7 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 9 of 19
42. (debark person18 plane2 city7)
   deleted: (in person18 plane2)
   added: (at person18 city7)
   goals met: 10 of 19
43. (fly plane1 city0 city15 fl1 fl0)
   deleted: (at plane1 city0) (fuel-level plane1 fl1)
   added: (at plane1 city15) (fuel-level plane1 fl0)
   goals met: 9 of 19
44. (refuel plane1 city15 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 9 of 19
45. (debark person6 plane1 city15)
   deleted: (in person6 plane1)
   added: (at person6 city15)
   goals met: 10 of 19
46. (fly plane1 city15 city24 fl1 fl0)
   deleted: (at plane1 city15) (fuel-level plane1 fl1)
   added: (at plane1 city24) (fuel-level plane1 fl0)
   goals met: 10 of 19
47. (refuel plane1 city24 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 10 of 19
48. (debark person15 plane1 city24)
   deleted: (in person15 plane1)
   added: (at person15 city24)
   goals met: 11 of 19
49. (fly plane1 city24 city9 fl1 fl0)
   deleted: (at plane1 city24) (fuel-level plane1 fl1)
   added: (at plane1 city9) (fuel-level plane1 fl0)
   goals met: 11 of 19
50. (refuel plane1 city9 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 11 of 19
51. (debark person9 plane1 city9)
   deleted: (in person9 plane1)
   added: (at person9 city9)
   goals met: 12 of 19
52. (fly plane1 city9 city19 fl1 fl0)
   deleted: (at plane1 city9) (fuel-level plane1 fl1)
   added: (at plane1 city19) (fuel-level plane1 fl0)
   goals met: 12 of 19
53. (refuel plane1 city19 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 12 of 19
54. (board person7 plane1 city19)
   deleted: (at person7 city19)
   added: (in person7 plane1)
   goals met: 12 of 19
55. (fly plane1 city19 city7 fl1 fl0)
   deleted: (at plane1 city19) (fuel-level plane1 fl1)
   added: (at plane1 city7) (fuel-level plane1 fl0)
   goals met: 12 of 19
56. (refuel plane1 city7 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 12 of 19
57. (debark person7 plane1 city7)
   deleted: (in person7 plane1)
   added: (at person7 city7)
   goals met: 13 of 19
58. (fly plane1 city7 city21 fl1 fl0)
   deleted: (at plane1 city7) (fuel-level plane1 fl1)
   added: (at plane1 city21) (fuel-level plane1 fl0)
   goals met: 13 of 19
59. (refuel plane1 city21 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 13 of 19
60. (fly plane2 city7 city8 fl1 fl0)
   deleted: (at plane2 city7) (fuel-level plane2 fl1)
   added: (at plane2 city8) (fuel-level plane2 fl0)
   goals met: 13 of 19
61. (debark person16 plane2 city8)
   deleted: (in person16 plane2)
   added: (at person16 city8)
   goals met: 14 of 19
62. (board person17 plane1 city21)
   deleted: (at person17 city21)
   added: (in person17 plane1)
   goals met: 14 of 19
63. (board person12 plane1 city21)
   deleted: (at person12 city21)
   added: (in person12 plane1)
   goals met: 14 of 19
64. (fly plane1 city21 city4 fl1 fl0)
   deleted: (at plane1 city21) (fuel-level plane1 fl1)
   added: (at plane1 city4) (fuel-level plane1 fl0)
   goals met: 14 of 19
65. (refuel plane1 city4 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 14 of 19
66. (board person8 plane1 city4)
   deleted: (at person8 city4)
   added: (in person8 plane1)
   goals met: 14 of 19
67. (board person1 plane1 city4)
   deleted: (at person1 city4)
   added: (in person1 plane1)
   goals met: 14 of 19
68. (fly plane1 city4 city1 fl1 fl0)
   deleted: (at plane1 city4) (fuel-level plane1 fl1)
   added: (at plane1 city1) (fuel-level plane1 fl0)
   goals met: 14 of 19
69. (refuel plane1 city1 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 14 of 19
70. (debark person12 plane1 city1)
   deleted: (in person12 plane1)
   added: (at person12 city1)
   goals met: 15 of 19
71. (fly plane1 city1 city22 fl1 fl0)
   deleted: (at plane1 city1) (fuel-level plane1 fl1)
   added: (at plane1 city22) (fuel-level plane1 fl0)
   goals met: 15 of 19
72. (refuel plane1 city22 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 15 of 19
73. (debark person8 plane1 city22)
   deleted: (in person8 plane1)
   added: (at person8 city22)
   goals met: 16 of 19
74. (fly plane1 city22 city3 fl1 fl0)
   deleted: (at plane1 city22) (fuel-level plane1 fl1)
   added: (at plane1 city3) (fuel-level plane1 fl0)
   goals met: 16 of 19
75. (refuel plane1 city3 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 16 of 19
76. (debark person17 plane1 city3)
   deleted: (in person17 plane1)
   added: (at person17 city3)
   goals met: 17 of 19
77. (fly plane1 city3 city5 fl1 fl0)
   deleted: (at plane1 city3) (fuel-level plane1 fl1)
   added: (at plane1 city5) (fuel-level plane1 fl0)
   goals met: 17 of 19
78. (refuel plane1 city5 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 17 of 19
79. (debark person1 plane1 city5)
   deleted: (in person1 plane1)
   added: (at person1 city5)
   goals met: 18 of 19
80. (fly plane1 city5 city0 fl1 fl0)
   deleted: (at plane1 city5) (fuel-level plane1 fl1)
   added: (at plane1 city0) (fuel-level plane1 fl0)
   goals met: 19 of 19
